CSI API ETABS v1

# cAnalysisResultsSetupSetOptionMultiValuedCombo Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetOptionMultiValuedCombo(
    	int Value
    )

    Function SetOptionMultiValuedCombo (
    	Value As Integer
    ) As Integer

    Dim instance As cAnalysisResultsSetup
    Dim Value As Integer
    Dim returnValue As Integer

    returnValue = instance.SetOptionMultiValuedCombo(Value)

    int SetOptionMultiValuedCombo(
    	int Value
    )

    abstract SetOptionMultiValuedCombo :
            Value : int -> int

#### Parameters

Value

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cAnalysisResultsSetup Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com